[
  {
    "name": "Color",
    "units": [2, 48, 36, 46],
    "comment": "Two of these units seem to track brightness (bright vs dark), while the other two units seem to mostly track hue, dividing the space of hues between them. One responds to red/orange/yellow, while the other responds to purple/blue/turqoise. Unfortunately, their circuits seem to heavily rely on the existence of a Local Response Normalization layer after <code>conv2d0</code>, which makes it hard to reason about."
  },
  {
    "name": "Multicolor",
    "units": [3, 33, 35, 40, 17, 16, 57, 26, 31],
    "comment": "These units respond to mixtures of colors without an obvious strong spatial structure preference."
  },
  {
    "name": "Color Contrast",
    "units": [5, 9, 10, 12, 20, 21, 42, 45, 50, 53],
    "comment": "These units detect a color on one side of the receptive field, and a different color on the opposite side. Composed of lower-level color contrast detectors, they often respond to color transitions in a range of translation and orientation variations. Compare to earlier <a href='#group_conv2d0_color_contrast'>color contrast (<code>conv2d0</code>)</a> and later color contrast (<a href='#group_conv2d2_color_contrast'><code>conv2d2</code></a>, <a href='#group_mixed3a_color_contrast'><code>mixed3a</code></a>, <a href='#group_mixed3b_color_contrast_gradient'><code>mixed3b</code></a>)."
  },
  {
    "name": "Low Frequency",
    "units": [1, 13, 27, 47, 56, 60, 23, 49, 0, 43, 28, 29, 34, 8, 37, 19, 15, ],
    "comment": "These units seem to respond to lower-frequency edge patterns, but we haven't studied them very carefully."
  },
  {
    "name": "Complex Gabor",
    "units": [51, 58, 30, 25, 52, 54, 22, 61, 55],
    "comment": "Like Gabor Filters, but fairly invariant to the exact position, formed by adding together multiple Gabor detectors in the same orientation but different phases. We call these 'Complex' after <a href='https://en.wikipedia.org/wiki/Complex_cell'>complex cells</a> in neuroscience."
  },
  {
    "name": "hatch",
    "units": [14],
    "comment": "This unit detects Gabor patterns in two orthogonal directions, selecting for a \"hatch\" pattern."
  },
  {
    "name": "Gabor Like",
    "units": [4, 6, 32, 38, 41, 63, 7, 11, 18, 24, 39],
    "comment": "These units respond to edges stimuli, but seem to respond to a wider range of orientations, and also respond to color contrasts that align with the edge. We haven't studied them very carefully."
  },
  {
    "name": "Other Units",
    "units": [44, 62, 59],
    "comment": "Units that don't fit in another category.",
    "priority": -1
  },
]
